
## 🧱 Terraform Workflow Summary

| Step | Status |
|------|---------|
| 🧹 Format | ✅ `success` |
| ⚙️ Init | ✅ `success` |
| ✅ Validate | ✅ `success` |
| 🪄 Plan | ✅ `success` |

---

<details>
  <summary>🧩 <b>Terraform Plan</b> — Click to view</summary>

  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_eip.oidc_demo_nat[0] will be created
  + resource "aws_eip" "oidc_demo_nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-1"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-1"
          + "Owner"       = "Barigbue Nbira"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.oidc_demo_nat[1] will be created
  + resource "aws_eip" "oidc_demo_nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-2"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-2"
          + "Owner"       = "Barigbue Nbira"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.oidc_demo_internet_gateway will be created
  + resource "aws_internet_gateway" "oidc_demo_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-igw"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-igw"
          + "Owner"       = "Barigbue Nbira"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.oidc_demo_nat_gateway[0] will be created
  + resource "aws_nat_gateway" "oidc_demo_nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-1"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-1"
          + "Owner"       = "Barigbue Nbira"
        }
    }

  # module.vpc.aws_nat_gateway.oidc_demo_nat_gateway[1] will be created
  + resource "aws_nat_gateway" "oidc_demo_nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-2"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-nat-2"
          + "Owner"       = "Barigbue Nbira"
        }
    }

  # module.vpc.aws_route_table.oidc_demo_private_route_table[0] will be created
  + resource "aws_route_table" "oidc_demo_private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-private-1"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-private-1"
          + "Owner"       = "Barigbue Nbira"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.oidc_demo_private_route_table[1] will be created
  + resource "aws_route_table" "oidc_demo_private_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-private-2"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-private-2"
          + "Owner"       = "Barigbue Nbira"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.oidc_demo_public_route_table will be created
  + resource "aws_route_table" "oidc_demo_public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-public"
          + "Owner"       = "Barigbue Nbira"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "aws-oidc-demo-terraform-github-actions-public"
          + "Owner"       = "Barigbue Nbira"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.oidc_demo_private_route_table_association[0] will be created
  + resource "aws_route_table_association" "oidc_demo_private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.oidc_demo_private_route_table_association[1] will be created
  + resource "aws_route_table_association" "oidc_demo_private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.oidc_demo_public_route_table[0] will be created
  + resource "aws_route_table_association" "oidc_demo_public_route_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.oidc_demo_public_route_table[1] will be created
  + resource "aws_route_table_association" "oidc_demo_public_route_table" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.oidc_demo_private_subnet[0] will be created
  + resource "aws_subnet" "oidc_demo_private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-private-1"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/internal-elb"                              = "1"
        }
      + tags_all                                       = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-private-1"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/internal-elb"                              = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.oidc_demo_private_subnet[1] will be created
  + resource "aws_subnet" "oidc_demo_private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-private-2"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/internal-elb"                              = "1"
        }
      + tags_all                                       = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-private-2"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/internal-elb"                              = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.oidc_demo_public_subnet[0] will be created
  + resource "aws_subnet" "oidc_demo_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-public-1"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/elb"                                       = "1"
        }
      + tags_all                                       = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-public-1"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/elb"                                       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.oidc_demo_public_subnet[1] will be created
  + resource "aws_subnet" "oidc_demo_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-public-2"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/elb"                                       = "1"
        }
      + tags_all                                       = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-public-2"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
          + "kubernetes.io/role/elb"                                       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.oidc_demo_vpc will be created
  + resource "aws_vpc" "oidc_demo_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-vpc"
          + "Owner"                                                        = "Barigbue Nbira"
          + "Project"                                                      = "aws-oidc-demo-terraform-github-actions-demo"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
        }
      + tags_all                             = {
          + "Environment"                                                  = "production"
          + "Name"                                                         = "aws-oidc-demo-terraform-github-actions-vpc"
          + "Owner"                                                        = "Barigbue Nbira"
          + "Project"                                                      = "aws-oidc-demo-terraform-github-actions-demo"
          + "kubernetes.io/cluster/aws-oidc-demo-terraform-github-actions" = "shared"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = (sensitive value)
  + public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id             = (known after apply)
  ```
</details>

---

🌍 **Region:** us-east-1  
💻 **Triggered by:** @Barry-dE  
🕒 **Timestamp:** Fri, 17 Oct 2025 08:21:08 GMT
